Revit 2027 API
ParameterTypeId.PipingConnectionType Property
 "Connection Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PipingConnectionType { get; }
Public Shared ReadOnly Property PipingConnectionType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PipingConnectionType {
	ForgeTypeId^ get ();
}
static member PipingConnectionType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace